packages/inductiva/inductiva-0.3.5-py3-none-any.whl/inductiva/templates/heat_sink/openfoam/files/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/parameters"

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform $airTemperature;

boundaryField
{

    inlet_fluid
    {
        type            fixedValue;
        value           $internalField;
    }
    walls_fluid
    {
        type            zeroGradient;
    }
    outlet_fluid
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    fluid_to_fins
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
}

// ************************************************************************* //
